<?php
require 'inc/header.php';

// 1-100 хүртэлх бүх тоог хэвлэ
// for ($i = 1; $i <= 100; $i++) {
//     echo $i . ' ';
// }

// 100 - 1 хүртэлх бүх тоог хэвлэ
// for ($i = 100; $i > 0; $i--) {
//     echo $i . ' ';
// }

// 100-200 хүртэлх бүх сондгой тоог хэвлэ
// for ($i = 99; $i <= 200; $i += 3) {
//     echo $i . '<br>';
// }
// for ($i = 100; $i > 1; $i--) {
//     if ($i % 2 == 1) {
//         echo "$i бол сондгой тоо<br>";
//     }
// }
// x тооны бүх хуваагчдыг ол
$x = 1700;
// Ямар ч тооны талаас дээш байгаа тоо нь тухайн тоог хувааж чадахгүй тул 2-т хуваагаад алгоритмаа илүү хурдан ажилуулна.
for ($i = 2; $i <= $x / 2; $i++) {
    if ($x % $i == 0) {
        echo $i . '  bol huwaagdagch <br>';
    }

}
require 'inc/footer.php';
