<?php
require 'inc/header.php';

// Тэмдэгт мөрийг залгах
$name = 'Сараа';
// += , -= , ** гэдэг шиг тэмдэгтийг залгаж ашиглах боломжтой юм.
$name .= ' Нараа';
echo $name;
//Refrence буюу заагч
//Ингэж бичвэл санах ойд $a хувьсагчийн хуулбарыг $b хувьсагчид өгдөг ба $a өөрчлөхөд b өөрчлөгдөхгүй
$a = 12;
$b = $a; // $b = 12; болсон байгаа
$a = 23; // $a = 23 болсон ч $b = 12 хэвээрээ л байгаа

//Харин ингэж бичвэл санах ойд $a ба $b хувсагчид нэг заагчийг заах юм.
$a = 12;
$b = &$a;
$a = 99; // $b хувьсагч $a хувьсагчтай санах ойн нэг заагчтай байгаа тул $b = 99 болно.
require 'inc/footer.php';
